#!/bin/bash

# 1. 确保在 source 分支
git checkout source

# 2. 检查是否有 commit 信息传入
if [ -z "$1" ]
then
    message="site update $(date +'%Y-%m-%d %H:%M:%S')"
else
    message="$1"
fi

echo "---------------------------------------"
echo "🚀 开始发布静态网页到 GitHub Pages..."
echo "---------------------------------------"

# 3. 执行 Hexo 部署连招
hexo clean && hexo g && hexo d

echo "---------------------------------------"
echo "📦 开始备份源码到 source 分支..."
echo "---------------------------------------"

# 4. 执行 Git 源码备份
git add .
git commit -m "$message"
git push origin source

echo "---------------------------------------"
echo "✨ 全部完成！你的博客已上线且源码已同步。"
echo "---------------------------------------"